Autodesk.Revit.DB.FootPrintRoof.GetProfiles
Retrieve all the curveLoops of FootPrintRoof.

Autodesk.Revit.DB.FootPrintRoof.CurtainGrids
Retrieve all the CurtainGrid objects of a FootPrintRoof.
Remarks: Only applicable when the object is a Curtain FootPrintRoof.

Autodesk.Revit.DB.FootPrintRoof.Overhang(Autodesk.Revit.DB.ModelCurve)
Retrieve or set the Overhang of the curve.
Remarks: Only applicable when the FootPrintRoof is created with Pick Walls.

Autodesk.Revit.DB.FootPrintRoof.ExtendIntoWall(Autodesk.Revit.DB.ModelCurve)
Retrieve or set whether extend into wall the curve.
Remarks: Only applicable when the FootPrintRoof is created with Pick Walls.

Autodesk.Revit.DB.FootPrintRoof.Offset(Autodesk.Revit.DB.ModelCurve)
Retrieve or set the Offset of the curve.

Autodesk.Revit.DB.FootPrintRoof.SlopeAngle(Autodesk.Revit.DB.ModelCurve)
Retrieve or set the SlopeAngle of the curve.
Remarks: The value is a "slope" measurement. For example, 0.5 is one unit of rise for each 2 units of run. This creates
a slope of 26.57 degrees (the arctangent of 0.5).

Autodesk.Revit.DB.FootPrintRoof.DefinesSlope(Autodesk.Revit.DB.ModelCurve)
Retrieve or set the DefinesSlope of the curve.

Autodesk.Revit.DB.FootPrintRoof
Represents kinds of FootPrintRoofs.
Remarks: The FootPrintRoof object represents some kinds of FootPrintRoof in Revit. The RoofType
property is used to distinguish the type of the roof.